/*
https://www.nowcoder.com/questionTerminal/a2edd6fa665a4c5b93ed111e1e581695?toCommentId=381288

cookie是存储在客户端 session是存储在服务端
网络延迟是指在传输介质中传输所用的时间，即从报文开始进入网络到它开始离开网络之间的时间

A类IP地址范围从1.0.0.0 到126.0.0.0。可用的A类网络有126个。
B类IP地址范围从128.0.0.0到191.255.255.255。可用的B类网络有16382个 。
C类IP地址范围从192.0.0.0到223.255.255.255。C类网络可达209万余个。
D类地址用于多点广播（Multicast）。 D类IP地址第一个字节以“lll0”开始，它是一个专门保留的地址。它并不指向特定的网络，目前这一类地址被用在多点广播（Multicast）中。多点广播地址用来一次寻址一组计算机，它标识共享同一协议的一组计算机。
E类IP地址以“llll0”开始，为将来使用保留。

ARP欺骗攻击： 分为对路由器ARP表的欺骗和对内网PC的网关欺骗。 第一种ARP欺骗的原理是——截获网关数据。 第二种ARP欺骗的原理是—  —伪造网关。
重放攻击：重放攻击（Replay Attacks）又称重播攻击、回放攻击或新鲜性攻击（FreshnessAttacks）是指攻击者发送一个目的主机已接收过的包，来达到欺骗系统的目的，主要用于身份认证过程，破坏认证的正确性。
暴力攻击：暴力破解攻击是指攻击者通过系统地组合所有可能性（例如登录时用到的账户名、密码），尝试所有的可能性破解用户的账户名、密码等敏感信息。攻击者会经常使用自动化脚本组合出正确的用户名和密码。
DNS欺骗攻击：DNS欺骗就是攻击者冒充域名服务器的一种欺骗行为。 如果可以冒充域名服务器，然后把查询的IP地址设为攻击者的IP地址。

网络层：IP协议、ICMP协议、ARP协议、RARP协议。
传输层：UDP协议、TCP协议。
应用层：FTP（文件传送协议）、Telenet（远程登录协议）、DNS（域名解析协议）、SMTP（邮件传送协议），POP3协议（邮局协议），HTTP协议， SNMP协议， TFTP。
编辑于 2015-09-17 13:24:00
 */
public class Tes {
}
